
# 15 字符串：格式化
# replacement
# format

# "{0} love {1}.{2}".format("I","FishC","com")
# "{a} love {b}.{c}".format(a="I",b="FishC",c="com")

# print('\ta')
# print('\\')

# "{{0}}".format("不打印")

# '{0:.1f}{1}'.format(27.658,'GB')


# 字符串格式化符号
# 1.  %c    格式化字符及其ASCII码
# 2.  %s    格式化字符串
# 3.  %d    格式化整数
# 4.  %o    格式化无符号八进制数
# 5.  %x    格式化无符号十六进制数
# 6.  %X    格式化无符号十六进制数（大写）
# 7.  %f    格式化定点数，可指定小数点后的精度
# 8.  %e    用科学计数法格式化定点数
# 9.  %E    作用同%e 
# 10. %g    根据值的大小确定使用%f或%e
# 11. %G    根据值的大小确定使用%f或%e

# 格式化操作辅助命令
# 1.  m.n    m小数总位数，n小数点后位数
# 2.  -      用于左对齐
# 3.  +      用于右对齐
# 4.  #      在八进制显示 '0o' 十六进制显示 '0x'
# 5.  0      用0填充空格

# 字符串转义字符含义

# \'         单引号
# \"         双引号
# \a         发出系统响铃声
# \b         退格符
# \n         换行符
# \t         横向制表符
# \v         纵向制表符
# \r         回车符
# \f         换页符
# \o         八进制数代表的字符
# \x         十六进制代表的字符
# \0         表示一个空字符
# \\         反斜杠